org/core.org
#+title: AltLinux builder base docker image
* Auxiliary Information                                            :noexport:
:PROPERTIES:
:CUSTOM_ID: auxiliary-information
:END:
The setupfile contain global common property configuration:
#+SETUPFILE: .configuration/global_vars_org.setup
#+SETUPFILE: .configuration/global_property_org.setup
#+SETUPFILE: .configuration/global_vars_html.setup
#+EXPORT_FILE_NAME: ../Readme
#+OPTIONS: auto-id:t

* About
:PROPERTIES:
:CUSTOM_ID: about
:END:

This is [[https://hub.docker.com/_/alt][alt base docker image]] using [[https://github.com/just-containers/s6-overlay][s6-overlay]] for buid software under linux. The basic idea was taken from [[https://github.com/tcl2020/tcl2020-build][tcl2020-build]] .

It  is self-hosting at https://chiselapp.com/user/oupfiz5/repository/alt-s6-builder.

If you are reading this on GitHub, then you are looking at a Git mirror of the self-hosting tcl-build repository.  The purpose of that mirror is to test and exercise Fossil's ability to export a Git mirror and using Github CI/CD  (Github Actions). Nobody much uses the GitHub mirror, except to verify that the mirror logic works. If you want to know more about tcl-build, visit the official self-hosting site linked above.

* Table of Contents :TOC_3:noexport:
:PROPERTIES:
:CUSTOM_ID: table-of-contents
:END:
- [[#about][About]]
- [[#prerequisite][Prerequisite]]
  - [[#tools][Tools]]
  - [[#third-party-tools][Third party tools]]
- [[#installation][Installation]]
  - [[#download-from-dockerhub][Download from dockerhub]]
  - [[#build-from-chiselapp-fossil][Build from chiselapp (fossil)]]
  - [[#build-from-github][Build from github]]
  - [[#configuration][Configuration]]
    - [[#build-arguments][Build arguments]]
    - [[#example-of-build][Example of build]]
- [[#configuration-options][Configuration options]]
  - [[#general-options][General options]]
  - [[#timezone][Timezone]]
- [[#applications][Applications]]
  - [[#configuration-1][Configuration]]
- [[#usage][Usage]]
  - [[#builder][Builder]]
  - [[#build-applications][Build applications]]
- [[#prepare-source-packages][Prepare source packages]]
- [[#continues-integration][Continues Integration]]
- [[#maintenance][Maintenance]]
  - [[#log-output][Log output]]
  - [[#shell-access][Shell access]]

* Prerequisite
:PROPERTIES:
:CUSTOM_ID: prerequisite
:END:
** Tools
:PROPERTIES:
:CUSTOM_ID: tools
:END:
1. *nix operation system
2. Install Docker
3. Install git (optional)
4. Install fossil (optional)
** Third party tools
:PROPERTIES:
:CUSTOM_ID: third-party-tools
:END:
They are using for testing and scanning:
1. [[https://github.com/bats-core][BATS]]
2. [[https://github.com/koalaman/shellcheck/][Shellcheck]]
3. [[https://github.com/hadolint/hadolint][Hadolynt]]
4. [[https://github.com/goodwithtech/dockle][Dockle]]
5. Snyk (todo)
6. Trivy (todo)

* Installation
:PROPERTIES:
:CUSTOM_ID: installation
:END:
** Download from dockerhub
:PROPERTIES:
:CUSTOM_ID: download-from-dockerhub
:END:
#+begin_example
docker pull oupfiz5/alt-s6-builder:23.04
#+end_example

** Build from chiselapp (fossil)
:PROPERTIES:
:CUSTOM_ID: build-from-chiselapp--fossil-
:END:
#+begin_example
fossil clone https://chiselapp.com/user/oupfiz5/repository/alt-s6-builder alt-s6-builder.fossil
mkdir alt-s6-builder
cd alt-s6-builder
fossil open ../alt-s6-builder.fossil
docker build -t oupfiz5/alt-s6-builder:23.04 .
#+end_example

** Build from github
:PROPERTIES:
:CUSTOM_ID: build-from-github
:END:
#+begin_example
git clone https://github.com/oupfiz5/alt-s6-builder.git
cd alt-s6-builder
docker build -t oupfiz5/alt-s6-builder:23.04 .
#+end_example

** Configuration
:PROPERTIES:
:CUSTOM_ID: configuration
:END:
*** Build arguments
:PROPERTIES:
:CUSTOM_ID: build-arguments
:END:
 |----------------+---------+-------------------------------|
 | Arguments      | Default | Description                   |
 |----------------+---------+-------------------------------|
 | BUILD_DATE     | none    | Set build date for label      |
 |----------------+---------+-------------------------------|
 | FOSSIL_VERSION | 2.21    | Set upload fossil version     |
 |----------------+---------+-------------------------------|
 | VERSION        | none    | Set version for label         |
 |----------------+---------+-------------------------------|

*** Example of build
:PROPERTIES:
:CUSTOM_ID: example-of-build
:END:
#+begin_example
  docker build \
         --build-arg BUILD_DATE=$(date -u +"%Y-%m-%dT%H:%M:%SZ") \
         --build-arg VERSION='23.04' \
         --build-arg FOSSIL_VERSION='2.21' \
         -t oupfiz5/alt-s6-builder \
         -f ./Dockerfile \
          .
#+end_example

* Configuration options
:PROPERTIES:
:CUSTOM_ID: configuration-options
:END:
For configuration is using environment variables.
** General options
:PROPERTIES:
:CUSTOM_ID: general-options
:END:
|--------------------+---------+-------------------------------------|
| Option             | Default | Description                         |
|--------------------+---------+-------------------------------------|
| TZ                 |     UTC | Set timezone, example Europe/Moscow |
|--------------------+---------+-------------------------------------|
** Timezone
:PROPERTIES:
:CUSTOM_ID: timezone
:END:
Set the timezone for the container, defaults to UTC. To set the timezone set the desired timezone with the variable TZ.

#+begin_example
mkdir -p $PWD/workspaces
docker run -itd \
    -v $PWD/workspaces:/workspaces\
    -v $PWD/builds:/builds \
    --env 'TZ=Europe/Moscow' \
    --name=alt-s6-builder \
    oupfiz5/alt-s6:builder:23.04
#+end_example

* Applications
:PROPERTIES:
:CUSTOM_ID: applications
:END:
The docker support builds for  the following applications:
- tcl
- tcllib
- rl_json
- NaviServer (plus modules)
- tDOM
- xotcl

** Configuration
:PROPERTIES:
:CUSTOM_ID: configuration
:END:
For configuration is using docker environment variable and/or =builds/env-vars.sh=

|--------------------+---------+-------------------------------------|
| Option             | Default | Description                         |
|--------------------+---------+-------------------------------------|
| PREFIX             |    /usr | Default values for prefix           |
|--------------------+---------+-------------------------------------|
| NS_VERSION         | 4.99.24 | Define NaviServer version           |
|--------------------+---------+-------------------------------------|
| NS_MODULES_VERSION | 4.99.24 | Define NaviServer modules version   |
|--------------------+---------+-------------------------------------|
| RL_JSON_VERSION    |  0.11.2 | Define [[https://github.com/RubyLane/rl_json][RL_JSON]] version              |
|--------------------+---------+-------------------------------------|
| TCL_VERSION        |  8.6.12 | Define tcl version                  |
|--------------------+---------+-------------------------------------|
| TCLLIB_VERSION     |    1.21 | Define tcl lib version              |
|--------------------+---------+-------------------------------------|
| TDOM_VERSION       |   0.9.1 | Define tdom version                 |
|--------------------+---------+-------------------------------------|
| XOTCL_VERSION      |   2.4.0 | Define xotcl version                |
|--------------------+---------+-------------------------------------|

* Usage
:PROPERTIES:
:CUSTOM_ID: usage
:END:
** Builder
:PROPERTIES:
:CUSTOM_ID: builder
:END:
Run the build container in the background with Docker:
#+begin_example
mkdir -p $PWD/workspaces
docker run -itd \
    -v $PWD/workspaces:/workspaces\
    -v $PWD/builds:/builds \
    --name=alt-s6-builder \
    oupfiz5/alt-s6-builder:23.04
#+end_example

