org/core.org
** Build applications
:PROPERTIES:
:CUSTOM_ID: build-applications
:END:
Build all program in tcl-build using a =docker exec= and default congratulations:
#+begin_src sh :tangle no
docker exec -it alt-s6-builder bash /builds/all-build.sh
#+end_src

Build any applications with version customization in tcl-build using =docker exec=. For example install tcl version 8.6.12 is:
#+begin_src sh :tangle no
  docker exec -it \
         -e TCL_VERSION=8.6.12 \
         alt-s6-builder \
         bash /builds/tcl-build.sh
#+end_src

Modify the source code of any package in the workspaces directory. Then you can use make, cmake, ... to rebuild the container with the changes.  Use the build container with your favorite IDE.

* Prepare source packages
:PROPERTIES:
:CUSTOM_ID: prepare-source-packages
:END:

Source packages are added to the Docker image using the =builds/build-all.sh= script.

To add packages or features create a two shell scripts in =builds= directory.  One shell script will download the source package: =yourpackage-download.sh=. The other script will build the package: =yourpackage-build.sh=.  Add your new build script, =yourpackage-build.sh=, to =builds/all-build.sh=.

* Continues Integration
:PROPERTIES:
:CUSTOM_ID: continues-integration
:END:
For  build and push docker images using  [[https://github.com/oupfiz5/build-tcl/blob/master/.github/workflows/on-push.yaml][Github Actions workflow]]. Flow process is [[https://guides.github.com/introduction/flow/][GitHub flow]].
* Maintenance
:PROPERTIES:
:CUSTOM_ID: maintenance
:END:
** Log output
:PROPERTIES:
:CUSTOM_ID: log-output
:END:
For debugging and maintenance purposes you may want access the output log. If you are using Docker version 1.3.0 or higher you can access a running containers shell by starting bash using docker interactive:

#+begin_example
docker run -it --rm \
       --name=alt-s6-builder \
       oupfiz5/alt-s6:builder \
       /bin/bash
#+end_example

** Shell access
:PROPERTIES:
:CUSTOM_ID: shell-access
:END:
   For debugging and maintenance purposes you may want access the containers shell. If you are usingDocker version 1.3.0 or higher you can access a running containers shell by starting bash using docker exec:
#+begin_example
docker exec -it alt-s6-builder /bin/bash
#+end_example
* Code :code:noexport:
:PROPERTIES:
:CUSTOM_ID: code
:END:
** VERSIONS :code:
:PROPERTIES:
:CUSTOM_ID: versions
:END:
#+begin_src sh :shebang ""
  # * Versions
  FOSSIL_VERSION="${FOSSIL_VERSION:-2.21}" \
  NS_VERSION="${NS_VERSION:-4.99.24}"
  NS_MODULES_VERSION="${NS_MODULES_VERSION:-4.99.24}"
  RL_JSON_VERSION="${RL_JSON_VERSION:-0.11.2}"
  TDOM_VERSION="${TDOM_VERSION:-0.9.1}"
  THREAD_VERSION="${THREAD_VERSION:-2.8.7}"
  TCL_VERSION="${TCL_VERSION:-8.6.12}"
  TCLLIB_VERSION="${TCLLIB_VERSION:-1.21}"
  XOTCL_VERSION="${XOTCL_VERSION:-2.4.0}"

  CONTAINER_NAME="${CONTAINER_NAME:-alt-s6-builder}"
  IMAGE_REPOSITORY="${IMAGE_REPOSITORY:-oupfiz5}"
  IMAGE_NAME="${IMAGE_NAME:-alt-s6-builder}"
  IMAGE_TAG="${IMAGE_TAG:-23.04}"
  BASE_IMAGE_REPOSITORY="${BASE_IMAGE_REPOSITORY:-oupfiz5}"
  BASE_IMAGE_NAME="${BASE_IMAGE_NAME:-alt-s6}"
  BASE_IMAGE_TAG="${BASE_IMAGE_TAG:-sisyphus-3.1.4.2}"
#+end_src
** ../.fossil-settings/crlf-glob
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-crlf-glob
:END:
#+begin_src sh :shebang ""
  *
#+end_src
** ../.fossil-settings/crlf-glob.no-warn :code:
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-crlf-glob-no-warn
:END:
#+begin_src sh :shebang ""
  *
#+end_src
** ../.fossil-settings/ignore-glob :code:
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-ignore-glob
:END:
#+begin_src sh :shebang ""
  .git/
  .github-mirroring/*
  docs/
  org/.configuration/*
  tests/.bats-battery/*/.git
  tests/.bats-battery/*/.github
  workspaces/
#+end_src
** ../.fossil-settings/ignore-glob.no-warn :code:
:PROPERTIES:
:CUSTOM_ID: ----fossil-settings-ignore-glob-no-warn
:END:
#+begin_src sh :shebang ""
  *
#+end_src
** ../.github/workflows/on-push.yaml :code:
:PROPERTIES:
:CUSTOM_ID: ----github-workflows-on-push-yaml
:END:

#+begin_src yaml :shebang ""
  name: Build and push docker images

  on:
    push:
      branches:
        - master
        - main
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile'
        - 'src/rootfs/*'
        - 'src/hook/*'
        - 'src/*.sh'
        - 'src/VERSIONS'
        - 'tests/**'
    pull_request:
      branches:
        - master
        - main
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile'
        - 'src/rootfs/*'
        - 'src/hook/*'
        - 'src/*.sh'
        - 'tests/**'
        - 'src/VERSIONS'

  jobs:
    build:
      name: Build and push image to dockerhub
      runs-on: ubuntu-latest
      steps:
        - name: Repo checkout
          uses: actions/checkout@v2

        - name: Login to DockerHub Registry
          run: |
            echo  ${{ secrets.DOCKERHUB_TOKEN }} | docker login --username ${{ secrets.DOCKERHUB_USERNAME }} --password-stdin

        - name: Build images
          run: |
            cd ${GITHUB_WORKSPACE}/src/hook
            ./build.sh

        - name: Push images
          run: |
            cd ${GITHUB_WORKSPACE}/src/hook
            ./push.sh
#+end_src
** ../.github/workflows/test.yaml :code:
:PROPERTIES:
:CUSTOM_ID: ----github-workflows-test-yaml
:END:
#+begin_src yaml :shebang ""
  name: Tests

  # * Controls
  # Controls when the action will run.
  on:
    push:
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile'
        - 'src/rootfs/*'
        - 'src/hook/*'
        - 'src/builds/*'
        - 'src/*.sh'
        - 'src/VERSIONS'
        - 'tests/**'
      branches-ignore:
        - 'master'
        - 'main'
    pull_request:
      paths:
        - '.github/workflows/*'
        - '.github/*'
        - 'src/Dockerfile'
        - 'src/rootfs/*'
        - 'src/hook/*'
        - 'src/builds/*'
        - 'src/*.sh'
        - 'tests/**'
      branches-ignore:
        - 'master'
        - 'main'
    workflow_dispatch:

  # * Jobs
  jobs:
    checks:
      name: Checks
      runs-on: ubuntu-latest
      steps:
        - name: Repo checkout
          uses: actions/checkout@v2

        - name: Check shell files (shellcheck)
          run: |
            sudo apt-get update -y
            sudo apt-get install shellcheck
            cd ${GITHUB_WORKSPACE}/tests
            .bats-battery/bats-core/bin/bats 01.shellchecks.bats

        - name: Check Dockerfile (hadolint)
          run: |
            cd ${GITHUB_WORKSPACE}/tests
            .bats-battery/bats-core/bin/bats 02.dockerfile_check.bats

        - name: alt-s6-builder. Build. Check image and container. Check builds.
          run: |
            echo "::group::Build image"
            echo "Build image"
            set -a; source ${GITHUB_WORKSPACE}/src/VERSIONS ; set +a;
            export IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"
            cd ${GITHUB_WORKSPACE}/src/hook
            ./build.sh
            echo "::endgroup::"

            echo "::group::Check image and container"
            cd ${GITHUB_WORKSPACE}/tests
            echo "Check docker image (dockle)"
            .bats-battery/bats-core/bin/bats 03.docker_image_check.bats
            echo "Check docker container"
            .bats-battery/bats-core/bin/bats 04.container_check.bats
            echo "Check builds"
            .bats-battery/bats-core/bin/bats 05.builds_check.bats
            echo "::endgroup::"
#+end_src

** ../.github/.trigger_on_push :code:
:PROPERTIES:
:CUSTOM_ID: ----github--trigger-on-push
:END:
#+begin_src yaml :shebang ""
  Trigger: 1
#+end_src
** ../.gitignore :code:
:PROPERTIES:
:CUSTOM_ID: ----gitignore
:END:
#+name: .gitignore
#+begin_src sh :shebang ""
  .fslckout
  .projectile
  /workspaces/*
  .fossil-settings/*
#+end_src
** Dockerfile :code:
:PROPERTIES:
:CUSTOM_ID: dockerfile
:END:
#+begin_src sh :shebang ""
  # syntax=docker/dockerfile:1.4

  # * Arguments
  ARG \
        BUILD_DATE="${BUILD_DATE}" \
        FOSSIL_VERSION="${FOSSIL_VERSION}" \
        BASE_IMAGE_NAME="${BASE_IMAGE_NAME}" \
        BASE_IMAGE_REPOSITORY="${UBUNTU_IMAGE_REPOSITORY}" \
        BASE_IMAGE_TAG="${UBUNTU_IMAGE_TAG}" \
        NS_VERSION="${NS_VERSION}" \
        NS_MODULES_VERSION="${NS_MODULES_VERSION}" \
        RL_JSON_VERSION="${RL_JSON_VERSION}" \
        TCL_VERSION="${TCL_VERSION}" \
        TCLLIB_VERSION="${TCLLIB_VERSION}" \
        THREAD_VERSION="${THREAD_VERSION}" \
        XOTCL_VERSION="${XOTCL_VERSION}" \
        TDOM_VERSION="${TDOM_VERSION}"

    FROM ${BASE_IMAGE_REPOSITORY}/${BASE_IMAGE_NAME}:${BASE_IMAGE_TAG}

    # ** Environments
    ENV \
        FOSSIL_VERSION=${FOSSIL_VERSION} \
        NS_VERSION=${NS_VERSION} \
        NS_MODULES_VERSION=${NS_MODULES_VERSION} \
        RL_JSON_VERSION=${RL_JSON_VERSION} \
        TCL_VERSION=${TCL_VERSION} \
        TCLLIB_VERSION=${TCLLIB_VERSION} \
        THREAD_VERSION=${THREAD_VERSION} \
        XOTCL_VERSION=${XOTCL_VERSION} \
        TDOM_VERSION=${TDOM_VERSION}

    # * Labels
    LABEL \
        maintainer="Oupfiz V <oupfiz5@yandex.ru>" \
        org.opencontainers.image.created="${BUILD_DATE}" \
        org.opencontainers.image.authors="Oupfiz V (Five)" \ org.opencontainers.image.url="https://chiselapp.com/user/oupfiz5/repository/alt-s6-builder/home" \ org.opencontainers.image.documentation="https://chiselapp.com/user/oupfiz5/repository/alt-s6-builder/wiki" \ org.opencontainers.image.source="https://chiselapp.com/user/oupfiz5/repository/alt-s6-builder/brlist" \
        org.opencontainers.image.version="0.0.2d" \
        org.opencontainers.image.revision="" \
        org.opencontainers.image.vendor="" \
        org.opencontainers.image.licenses="" \
        org.opencontainers.image.ref.name="" \
        org.opencontainers.image.title="AltLinux image for build tcl packages" \
        org.opencontainers.image.description="AltLinux image for build tcl packages" \
        org.opencontainers.alt-s6-builder.version="${VERSION}"

    # * Environment

    # * Copy scripts
    COPY builds /builds
    COPY VERSIONS /VERSIONS

    # * Add
    ADD https://www.fossil-scm.org/home/uv/fossil-linux-x64-2.19.tar.gz /tmp/fossil-linux.tar.gz

    # * Run
    # hadolint ignore=DL3008,DL3003,DL3015
    RUN mkdir /var/lib/apt/lists/partial && \
        apt-get update && \
        apt-get install -y \
                apache2 \
                autoconf_2.60 \
                automake_1.16 \
                bison \
                boost-devel \
                cpp \
                curl \
                gcc \
                gcc-c++ \
                gdb \
                git \
                glibc-i18ndata \
                gnupg2 \
                libbsd-devel \
                libcurl-devel \
                libgd3-devel \
                libgeos-devel \
                libmemcached-devel \
                libminizip-devel \
                libpq5-devel \
                libproj-devel \
                libreadline-devel \
                libsqlite3-devel \
                libssl-devel \
                libtool \
                libuv-devel \
                libxml2-devel \
                libxslt-devel \
                libyajl-devel \
                lsb-release \
                make \
                openssl \
                pkg-config \
                postgresql14 \
                python3-module-pip \
                python3-module-virtualenv \
                swig \
                tzdata \
                wget \
                zlib-devel \
        && pip3 install --no-cache-dir "cmake==3.24.1.1" \
        && localedef -c -i en_US -f UTF-8 en_US.UTF-8 \
        && echo LANG="en_US.UTF-8" >> /etc/sysconfig/i18n \
        && echo LC_ALL="en_US.UTF-8" >> /etc/sysconfig/i18n \
        && cd /tmp \
        && tar xzf /tmp/fossil-linux.tar.gz -C /usr/bin \
        && rm /tmp/fossil-linux.tar.gz \
        && rm -r /usr/share/man/* \
        && apt-get clean \
        && rm -rf /var/lib/apt/lists  \
              /var/cache/apt/archives/*.rpm  \
              /var/cache/apt/*.bin

    # * Entrypoint
    ENTRYPOINT ["/init"]
#+end_src

** hook/build.sh :code:
:PROPERTIES:
:CUSTOM_ID: hook-build-sh
:END:
#+begin_src sh  :results output pp :noweb strip-export :dir ../src/hook
  # shellcheck disable=SC1091
  set -a; source ../VERSIONS ; set +a;

  IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"
  DOCKERFILE="${DOCKERFILE:-Dockerfile}"

  docker buildx build \
         --build-arg BASE_IMAGE_REPOSITORY="${BASE_IMAGE_REPOSITORY}" \
         --build-arg BASE_IMAGE_NAME="${BASE_IMAGE_NAME}" \
         --build-arg BASE_IMAGE_TAG="${BASE_IMAGE_TAG}" \
         --build-arg BUILD_DATE="$(date -u +"%Y-%m-%dT%H:%M:%SZ")" \
         --build-arg FOSSIL_VERSION="${FOSSIL_VERSION:-2.18}" \
         -t "${IMAGE}" \
         -f ../"${DOCKERFILE}" \
          ../.
#+end_src

** hook/push.sh :code:
:PROPERTIES:
:CUSTOM_ID: hook-push-sh
:END:
#+begin_src sh
  # shellcheck disable=SC1091
  set -a; source ../VERSIONS ; set +a;

  IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"

  docker push "${IMAGE}"
#+end_src

** rootfs/etc/cont-finish.d/.gitignore :code:noexport:notangle:
:PROPERTIES:
:CUSTOM_ID: rootfs-etc-cont-finish-d--gitignore
:END:
#+begin_src sh :shebang "" :tangle no
#+end_src

** rootfs/etc/cont-init.d/.gitignore :code:noexport:notangle:
:PROPERTIES:
:CUSTOM_ID: rootfs-etc-cont-init-d--gitignore
:END:
#+begin_src sh :shebang "" :tangle no
#+end_src

** rootfs/etc/fix-attrs.d/.gitignore :code:noexport:notangle:
:PROPERTIES:
:CUSTOM_ID: rootfs-etc-fix-attrs-d--gitignore
:END:
#+begin_src sh :shebang "" :tangle no
#+end_src
