org/core.org
** builds/rl_json-build.sh :code:
:PROPERTIES:
:CUSTOM_ID: builds-rl-json-build-sh
:END:
#+begin_src sh
  # shellcheck source=../src/builds/common.sh
  . /builds/common.sh
  # shellcheck source=../src/builds/env-vars.sh
  . /builds/env-vars.sh
  # shellcheck disable=SC1091
  . /VERSIONS

  build_setup

  package_directory=rl_json-"${RL_JSON_VERSION}"

  if [ ! -d /workspaces/"${package_directory}" ]; then
      cd /workspaces && sh /builds/rl_json-download.sh
      tar xvfz "${package_directory}".tar.gz
  fi

  mkdir -p /workspaces/logs
  cd /workspaces/"${package_directory}" || exit 1
  echo "Running the autoconf configure in /workspaces/${package_directory}"
  autoconf || exit 1
  ls -la config*
  echo "Building ${package_directory}"
  : > /workspaces/logs/"${package_directory}".log
  ./configure --prefix="${PREFIX}" \
       --with-tcl="${PREFIX}"/lib \
       --with-tclinclude="${PREFIX}"/include 2>&1 | tee -a /workspaces/logs/"${package_directory}".log
  # cut down on the output to stdout to make Travis-CI consoles faster
  make
  make install 2>&1 | tee -a /workspaces/logs/"${package_directory}".log

  build_cleanup
#+end_src

** builds/rl_json-download.sh :code:
:PROPERTIES:
:CUSTOM_ID: builds-rl-json-download-sh
:END:
#+begin_src sh
  if [ ! -f rl_json$-"{RL_JSON_VERSION}".tar.gz ] ; then
      echo "${WGET_OPTIONS}" https://github.com/RubyLane/rl_json/archive/refs/tags/"${RL_JSON_VERSION}".tar.gz
      wget "${WGET_OPTIONS}" https://github.com/RubyLane/rl_json/archive/refs/tags/"${RL_JSON_VERSION}".tar.gz -O rl_json-"${RL_JSON_VERSION}".tar.gz
  fi
#+end_src

* Tests :test:noexport:
:PROPERTIES:
:header-args:bats+:   :tangle (concat (file-name-directory (mapconcat 'identity (split-string  buffer-file-name "org/") "")) "/tests/" (nth 4 (org-heading-components)) )
:header-args:sh+:  :tangle (concat (file-name-directory (mapconcat 'identity (split-string  buffer-file-name "org/") "")) "/tests/" (nth 4 (org-heading-components)) )
:CUSTOM_ID: tests
:END:
** helpers.bash :test:
:PROPERTIES:
:CUSTOM_ID: helpers-bash
:END:
#+begin_src sh :shebang "" :results output pp :noweb strip-export :tangle-mode (identity #o644)
# * Load Add-ons
load '.bats-battery/bats-assert/load.bash'
load '.bats-battery/bats-file/load.bash'
load '.bats-battery/bats-support/load.bash'
#+end_src

** 01.shellchecks.bats :test:
:PROPERTIES:
:CUSTOM_ID: 01-shellchecks-bats
:END:
#+begin_src bats :results output pp :noweb strip-export

  setup() {
      targets=()
      while IFS=  read -r -d $'\0'; do
          targets+=("$REPLY")
      done < <(
          find \
              ../src/hook \
              ../src/builds \
              -type f ! -iname ".gitignore" \
              -print0
      )
  }

  @test "Check shell files" {
        run export LC_ALL=C.UTF-8; shellcheck "${targets[@]}"
        assert_success
  }

  @test "Check VERSION file" {
        run export LC_ALL=C.UTF-8; shellcheck --shell=sh --exclude=SC2034 ../src/VERSIONS
        assert_success
  }

#+end_src

#+RESULTS:
: 1..2
: ok 1 Check shell files
: /tmp/babel-5WGsj2
: ok 2 Check VERSION file

** 02.dockerfile_check.bats :test:
:PROPERTIES:
:CUSTOM_ID: 02-dockerfile-check-bats
:END:
#+begin_src bats :results output pp :noweb strip-export

  @test "Check Dockerfile" {
        run docker run --rm -i -v "${PWD}/../src":/work --workdir=/work  hadolint/hadolint hadolint -f json Dockerfile
        assert_success
  }

#+end_src

#+RESULTS:
: 1..1
: ok 1 Check Dockerfile
** 03.docker_image_check.bats :test:
:PROPERTIES:
:CUSTOM_ID: 03-docker-image-check-bats
:END:

#+begin_src bats :results output pp :noweb strip-export

  setup() {
        . ../src/VERSIONS
        IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"

        VERSION=$(
        curl --silent "https://api.github.com/repos/goodwithtech/dockle/releases/latest" | \
            grep '"tag_name":' | \
            sed -E 's/.*"v([^"]+)".*/\1/' \
           )
    }

  @test "Check docker image" {
      run docker run --rm \
          -v /var/run/docker.sock:/var/run/docker.sock \
          -v "$(pwd)"/.dockleignore:/.dockleignore \
          goodwithtech/dockle:v"${VERSION}" \
          --exit-code 1 \
          --exit-level fatal \
          "${IMAGE}"
      assert_success
    }
#+end_src

#+RESULTS:
: 1..1
: ok 1 Check docker image

** 04.container_check.bats :test:
:PROPERTIES:
:CUSTOM_ID: 04-container-check-bats
:END:
#+begin_src bats :results output pp :noweb strip-export

  setup() {
      . ../src/VERSIONS
      IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"
  }

  @test "Verify container run" {
        run docker run -d --rm --name="${CONTAINER_NAME}" "${IMAGE}"
        assert_success
  }

  @test "Verify state status container - running" {
        sleep 5
        run docker inspect --format 'result={{ .State.Status }}' "${CONTAINER_NAME}"
        assert_success
        assert_output 'result=running'
  }

  @test "Verify state running container - true" {
        run docker inspect --format 'result={{ .State.Running }}' "${CONTAINER_NAME}"
        assert_success
        assert_output 'result=true'
  }

  @test "Verify state restarting container - false" {
        run docker inspect --format 'result={{ .State.Restarting }}' "${CONTAINER_NAME}"
        assert_success
        assert_output 'result=false'
  }

  @test "Verify state error container - <empty>" {
        run docker inspect --format 'result={{ .State.Error }}' "${CONTAINER_NAME}"
        assert_success
        assert_output 'result='
  }

  @test "Verify restart count container - 0" {
        run docker inspect --format 'result={{ .RestartCount }}' "${CONTAINER_NAME}"
        assert_success
        assert_output 'result=0'
  }

  # @test "Verify AppArmor Profile - if applicable" {
  #       skip
  #       run docker inspect --format 'AppArmorProfile={{ .AppArmorProfile }}' "${CONTAINER_NAME}"
  #       assert_success
  #       refute_output "AppArmorProfile=[]"
  #       refute_output "AppArmorProfile="
  #       refute_output "AppArmorProfile=<no value>"
  # }

  @test "Verify container stop" {
        run docker container stop "${CONTAINER_NAME}"
        assert_success
  }

#+end_src

#+RESULTS:
: 1..7
: ok 1 Verify container run
: ok 2 Verify state status container - running
: ok 3 Verify state running container - true
: ok 4 Verify state restarting container - false
: ok 5 Verify state error container - <empty>
: ok 6 Verify restart count container - 0
: ok 7 Verify container stop

** 05.builds_check.bats :test:
:PROPERTIES:
:CUSTOM_ID: 05-builds-check-bats
:END:
#+begin_src bats :results output pp :noweb strip-export

  setup() {
      . ../src/VERSIONS
      IMAGE="${IMAGE:-${IMAGE_REPOSITORY}/${IMAGE_NAME}:${IMAGE_TAG}}"
      WORKSPACES="${BATS_TMPDIR}"/workspaces
  }

  @test "Remove container" {
      skip
      run docker container rm "${CONTAINER_NAME}" || true
      assert_success
  }

  @test "Run builder container" {
      mkdir -p "${WORKSPACES}"
      run docker run -itd \
             -v ${WORKSPACES}:/workspaces \
             -v $(pwd)/../src/builds:/builds \
             --name="${CONTAINER_NAME}" \
             "${IMAGE}"
      assert_success
  }

  @test "Build all" {
      sleep 5
      run docker exec \
          "${CONTAINER_NAME}" \
          bash /builds/all-build.sh
      assert_success
  }

  @test "Container stop" {
      run docker container stop "${CONTAINER_NAME}"
      assert_success
  }

  @test "Container remove" {
      run docker container rm "${CONTAINER_NAME}"
      assert_success
  }

  @test "Remove temporary directory (workspaces)" {
      run rm -rf "${WORKSPACES}"
      assert_success
  }

#+end_src

** shellcheck.sh :test:noexport:notangle:
:PROPERTIES:
:CUSTOM_ID: shellcheck-sh
:END:
#+begin_src sh :results output pp :noweb strip-export :tangle no
  set -e

  targets=()
  while IFS=  read -r -d $'\0'; do
      targets+=("$REPLY")
  done < <(
    find \
      ../src/rootfs/etc \
      ../src/hook \
      -type f \
      -print0
    )


  echo "Shellcheck files"
  LC_ALL=C.UTF-8 shellcheck "${targets[@]}"

  # VERSION were exclude from main check (above)
  # exclude warning https://github.com/koalaman/shellcheck/wiki/SC2034
  echo "Shellcheck VERSION"
  #LC_ALL=C.UTF-8 shellcheck --shell=sh --exclude=SC2034 VERSION

  exit $?
#+end_src

** docker_image_check.sh :test:noexport:notangle:
:PROPERTIES:
:CUSTOM_ID: docker-image-check-sh
:END:
#+begin_src sh :results output pp :noweb strip-export :tangle no
  set -e
  IMAGE_NAME="${1:-oupfiz5/alt-s6:builder}"

  # * Install dockle and check targets
  # Pay attention: some checks are ignored using .dockleignore
  VERSION=$(
      curl --silent "https://api.github.com/repos/goodwithtech/dockle/releases/latest" | \
          grep '"tag_name":' | \
          sed -E 's/.*"v([^"]+)".*/\1/' \
         ) && docker run --rm \
                         -v /var/run/docker.sock:/var/run/docker.sock \
                         -v "$(pwd)"/.dockleignore:/.dockleignore \
                         goodwithtech/dockle:v"${VERSION}" \
                         --exit-code 1 \
                         --exit-level fatal \
                         "${IMAGE_NAME}"
  exit $?
#+end_src

#+RESULTS:

** .dockleignore :test:
:PROPERTIES:
:CUSTOM_ID: -dockleignore
:END:
#+begin_src sh :shebang ""
# Use COPY instead of ADD in Dockerfile because need to add s6-overlay from urlencode
CIS-DI-0009
# Use latest tag because to check the image inside only
DKL-DI-0006
# set root to default user because it will be use for next build
CIS-DI-0001
#+end_src
** dockerfile_check.sh :test:noexport:notangle:
:PROPERTIES:
:CUSTOM_ID: dockerfile-check-sh
:END:
#+begin_src sh :results output pp :noweb strip-export :tangle no
    set -e

    # * Get list of targets
    targets=()
    while IFS=  read -r -d $'\0'; do
        targets+=("$REPLY")
    done < <(
      find \
         ../src/Dockerfile \
        -type f \
        -print0
      )

    # * Pull hadolint and check targets
    echo Test Dockerfile - $(date)
    docker run --rm -i hadolint/hadolint < "${targets[@]}" && echo "Success"

    exit $?
#+end_src

#+RESULTS:
: Test Dockerfile - Пт 16 июл 2021 00:36:29 MSK
: Success
